In [4]:
import numpy as np
import pandas as pd
import os

# Construct the path to the data file in an OS-independent way
data_dir='data'
filename='Salary_with_genders.csv'
# Get the current working directory of the script
current_dir = os.getcwd()

# Construct the path to the data file by going up one level ('..')
# and then into the 'data' folder.
file_path = os.path.join(current_dir, '..', '..', data_dir, filename)

# Normalize the path to resolve '..' and get the absolute path
file_path = os.path.abspath(file_path)

df = pd.read_csv(file_path)
df['str_Salary'] = df['Salary']
display(df.head())
df['Salary'] = df['Salary'].str.replace(r'[\$,]', '', regex=True).astype(float)
display(df.head())

,Surname,Name,Age,Gender,Country,Ethnicity,Start_date,Department,Position,Salary,str_Salary
0,Bold,Caroline,63,Female,United States,White,7/2/2012,Executive Office,President & CEO,"$166,400.00","$166,400.00"
1,Zamora,Jennifer,38,Female,United States,White,4/10/2010,IT/IS,CIO,"$135,200.00","$135,200.00"
2,Houlihan,Debra,51,Female,United States,White,5/5/2014,Sales,Director of Sales,"$124,800.00","$124,800.00"
3,Bramante,Elisa,34,Female,United States,Black or African American,1/5/2009,Production,Director of Operations,"$124,800.00","$124,800.00"
4,Del Bosque,Keyla,38,Female,United States,Black or African American,1/9/2012,Software Engineering,Software Engineer,"$118,809.60","$118,809.60"

,Surname,Name,Age,Gender,Country,Ethnicity,Start_date,Department,Position,Salary,str_Salary
0,Bold,Caroline,63,Female,United States,White,7/2/2012,Executive Office,President & CEO,166400.0,"$166,400.00"
1,Zamora,Jennifer,38,Female,United States,White,4/10/2010,IT/IS,CIO,135200.0,"$135,200.00"
2,Houlihan,Debra,51,Female,United States,White,5/5/2014,Sales,Director of Sales,124800.0,"$124,800.00"
3,Bramante,Elisa,34,Female,United States,Black or African American,1/5/2009,Production,Director of Operations,124800.0,"$124,800.00"
4,Del Bosque,Keyla,38,Female,United States,Black or African American,1/9/2012,Software Engineering,Software Engineer,118809.6,"$118,809.60"

In [8]:
df_mean_salary = df['Salary'].mean()
print(f"Gia tri trung binh cua mau la: {df_mean_salary}")

Gia tri trung binh cua mau la: 68603.77931034483

In [11]:
# Lay mau ngau nhien 30
sample = df.sample(n=30, random_state=42)
# Tinh gia tri trung binh cua mau
mean_salary = sample['Salary'].mean()
print(f"Gia tri trung binh cua mau la: {mean_salary}")

Gia tri trung binh cua mau la: 73327.62666666666

In [12]:
# Tinh z-score
z_scores = (sample['Salary'] - mean_salary) / sample['Salary'].std()
print("Z-scores:")
print(z_scores)

Z-scores:
155   -1.034125
144   -0.898535
101    1.813272
127    0.470928
140   -0.762944
138   -0.695149
42    -0.627354
15     1.338706
126    0.525164
65    -0.898535
112    1.338706
60    -0.898535
45    -0.695149
51    -0.762944
31    -0.020587
9      1.338706
113    1.338706
55    -0.762944
24     0.837022
154   -1.034125
137   -0.627354
166   -1.253781
128    0.457369
29     0.118393
56    -0.830739
41    -0.620574
109    1.338706
19     1.270911
16     1.338706
78    -1.101920
Name: Salary, dtype: float64

In [ ]:
# Tinh gia tri trung binh cua tong the
mean_population = df['Salary'].mean()
print(f"Gia tri trung binh cua tong the la: {mean_population}")